{"bigdata_ru": ["Если ли кто, кто нашел работу за рубежом в МЛ?", "Кто-нибудь работал с датасетом SpaceNet v2?", "Привет, а есть тут кто разбирется в squeezenet? возникло несколько вопросов", "Коллеги, кто может помочь с одной задачкой по алгоритмам за вознаграждение? Есть сильные спецы? Решаю на java", "Привет, бандиты. Кто-то разворачивал Impala с нуля?", "Добрый вечер! Заинтересовался машинным обучением, но совсем не знаю с чего начать. Можете подсказать что подучить, какую литературу почитать? Буду очень благодарен за помощь!", "Всем добрый день. Есть тут кто может помочь по тебе image processing? Есть пару вопросов. Буду очень благодарен. А именно  про Canny edge detector & Hough transform", "Добрый вечер. Можно задать вопрос про определение точности предсказание, в интернете не нашел удовлетворяющего ответа.", "Можно ли начинать изучать ml с книги Глубокое обучение. Погружение в мир нейтронных Николенко С., Кадурин А., Архангельская Е.?\nЕсли нет, то с чего лучше начать?\n\nhttps://www.chitai-gorod.ru/catalog/book/1020585"], "ru_python": ["Кто-то работал с TurboGears?", "друзья, тут есть спецы по selenium?", "Ребят, а кто с сокетами работал?", "Есть тут программисты экстраверты?)", "Всем привет", "У кого есть инстаграм", "Привет всем", "привет всем", "Приветствую всех! Есть вопрос по работе с портом usb", "👋 есть спецы по data science?", "Всем привет! Я тут новенький.  Кто может помочь с python3.7 selenium", "А где...новички", "Всем привет", "народ, а кто что слышал про smyt?", "Кто не будь работал с бекенда мобильного приложения на python?", "народ кто работал с либой  subprocess?", "Hello", "Никто не могет?(", "Есть кто бота на питоне писал?", "Доброго дня! Господа, кто может помочь", "Всем добрый день, я новый в чате...", "Ребята, у кого-то есть опыт парсинга данных с dropbox? может кто помочь опытом?", "Всем привет)", "Что это?", "Добрый день. Кто активно пользуется selenium ? напишите мне плиз, есть пару вопросов", "Всем привет . Кто сталкивался с настройкой python-socketio на сервере? Не хочеть бек с фронтом соединяться хоть тресни.", "может быть ты бы ссылку скопировал на сообщение с правилами, а не сами правила?", "Есть тут те, кто работают на macOS?", "Всем привет\nесть кто работал с OpenCV?", "Доброй ночи помогие с задачкой:", "кто умеет в красивомсупе парсить? )", "Добрый день. Вопрос под капот Пайтона сюда?", "Добрый день. Вопрос под капот Пайтона сюда?", "Можете мне помочь", "кто-нибудь знает достаточно глубоко waf?", "все привет!", "Привет, всем", "Привет", "Кто знаком с Flask.", "Товарищи, кто хочет поучаствовать в проекте?", "Привет всем", "Кто пользовался mode notebook", "Тут фрилансеры пайтонисты есть?", "Всем привет!", "Привет всем. Примите новичка с вопросом?", "Ребят, тут кто то работает с ботами в телеге?", "Здравствуйте.", "Всем привет. Ребят, не могли бы помочь с настройкой uwsgi и nginx?", "Кто-нибудь имел дело с mobile security framework ?", "Всем привет,скажите пожалуйста,с чего начинать изучать Python?", "Кто-нибудь писал плагины для kodi?", "@YouProgrammist_ghost  а я, как бы могу здесь спрашивать всё про пайтон?", "Ребята кто пользовался библиотекой bs4 для скрэпинга веб страниц?", "Помогите подгараю! Instagram_private_api кто использовал?", "Кто нибудь работал с tor и многопоточностью?", "ребят, слушайте, может решал кто задачу от яндекс.интервью насчет слияния?)", "а есть кто работал с TensorFlow   ?\nтакой вопрос:\nнатренировал сеть на своих картинках: цветы.\nно проблема в том что на тестовой картинке (машина) - показывает что это один из цветков.\nа мне хочется чтоб сеть говорила  цветок не найден", "Всем привет)", "Терминатор, ты меня напугал))\nВсем привет! Есть кто не спит?)", "есть люди которые работают с GitLab?", "Здравствуйте. Кто-нибудь работал в pandas?", "есть файл models.py\nв нём есть допустим класс User: ...\nмогу ли я добавить к нему функцию из другого файла?\nнапример создать файл models_utils.py, создать там User: ... def new_function(self, ...) ... @static def new_static_def()...\nи в конце models.py импортнуть models_utils.py, чтобы вызывать у models.User.new_function(). Будет ли оно работать?", "Здравствуйте, я новичок", "Кто-нибудь из присутствующих на Upwork получал работу?", "Всем доброго времени суток", "кто то парсил данные через bs4", "ребят)) а кто нить есть кто в qt понимает))  я тут разобраться не могу чуть чуть ))", "Кто-нибудь делал расширения для браузера для работы с ВК из присутствующих?", "Здорова, есть кто-то, кто работал с  mysql.connector?", "кто с urwid работал , есть вопрос", "Всем привет)", "Привет всем. Кому не сложно помочь с задачкой?)", "Кстати, кто в докере силен?", "привет, есть кто по odoo может подсказать?", "Ребята есть знакомые программисты работающие на C++ ?", "Кто сталкивался в ботами для Instagram, типа чата активности?", "Не могу разобраться с БД на питоне в боте. Кто свободен буду благодарен. Спасибо.", "кто из вас шарит в питоне", "Всем добрый день! Есть тут кто-то кто работал с ИИ НА python?", "всем здравствуйте! Кто-нибудь изучал нейронные сети в этой группе?", "Привет, ребят есть у кого опыт в работе с kivy?", "скажите лучше есть кто шарит в moviepy ?", "Помогите, пожалуйста, с джанго", "есть кто?", "Привет, кто может мне помочь?", "Есть кто нить кто разбирается в django", "Всем привет.", "есть люди которые могут дать совет Junior программистам по питону?)", "ребят кто может помочь?", "доброй ночи всем", "и вам не хворать. nometa.xyz", "Здравствуйте.", "Привет 👋\nЕсть знакомые кто парсит динамические страницы и может проконсультировать?", "Всем привет", "Можно вопрос не по Питону?)", "Здорова ребят)", "Здравствуйте", "Ребята, может к вам девушка за помощью обратиться?!", "Ребят кто может помочь по Django? есть некоторые вопросы", "Привет", "Всем доброго времени суток.", "Ребзя, здорова) Есть тут гуру по геометрическим алгоритмам?) Всю голову сломал, нужна помощь)", "Доброго времени суток. Есть вопрос по обработке ошибок. Скраплю сайт и записываю все в переменные, но если элемент не нашелся вылетает ошибка, а при ошибке хотелось бы в переменную записывать просто строку типа \"Not found\". Переменных много и мне к каждой применять поотдельности try except или можте есть какая-нибудь другая уловка? \n\n        title_name = title.find('a', {'class': 'title_link'})['title']\n        series = title.find('h3', {'class': 'original work'}).find('a').text", "Народ, кто разбирается с пакетом multiprocessing?", "Приветствую", "сасный.... ты анимешний пидар чтоли?)", "Хей! Всем привет", "кто может помочь с django + materializecss ?", "ребят умеет ктонить парсить строки поцарски?", "Поможете с задачами)?", "Парни у меня вопрос, немного не по питону. Как вы боритесь с ddos атаками? Какие то вещи первичные must have? Например сделали пуш на 500 000 юзерам. Они все зашли, крутится джанго. Сайт перестал открываться. Процессоры и ОЗУ все чисто в простое. А по логам, кроме этих 500к, ещё прицепило какие то китайские ip, которые стали перебирать по URL все уязвимости, типо pma искать и другое.? Кроме как банить ip, вручную не получается. Народ реальный страдает. Что делать?", "Всем привет.\nКто-нибудь хотя бы немного шарит в разработке ботов ВК на python'e?", "приветы", "Кто работал с библиотекой xml.etree?", "I need help, как говорится", "I need help, как говорится", "кто-то решает вшэ по инфе?", "Вам, наверное, лучше поискать в t.me/python_jobs", "Добрый день!\nЕсть действующий проект, написанный (python + django + postgresql)\nнужен человек, разбирающийся в этом. Ну и плюс - добавиться 1с ерп, 1С УТ", "Есть тут кто знает фреймворк aiohttp?", "кто помочь может?", "Привет всем!!", "Привет всем!", "Всем привет, ктото работал с дибой gspread?", "Зачем тогда чат?", "Можете помочь с задачей?", "друзья, можно вопрос?\nя новичек, нужна помощь", "Всем привет у кого был опыт реверс инжинирингом?", "Всем привет у кого был опыт реверс инжинирингом?", "Всем привет!  Как дела?", "Привет всем, кто-нибдуь работал с gmail API?", "Привет всем,кто разбирается в теории графов?", "Парни, привет,\nА кто хорошо разбирается в нейронных сетях?\nНужно помочь настроить кое-что.", "ребят, вопрос) про чистоту кода и стиль", "тут можно задавать вопросы?", "Кто-нибудь, помогите с апи яндекс или гугл карт, ради всего святого!!!!!!!!", "Товарищи, может кто помочь?\nЯ начинающий в питоне. Пытаюсь спарсить страницу и не выходит уже задолбался. Если у кого есть мин 5 свободных уделите пож. Задача тривиальная", "тоарищи, про, на вопрос по доке можете ответить?", "по доке может кто уточнить", "хэлпаните с ботом", "Парни, вопрос про гаченые ключи. У меня нету ящика, где отремонитровать мой bmw?", "Парни, вопрос про гаченые ключи. У меня нету ящика, где отремонитровать мой bmw?", "народ, есть кто из казани, кто хорошо разбирается в python?", "есть кто работает с Tensorflow?мне нужна маленькая конусультация🙏🙏🙏🙏", "моя пипка 3 питона не отзывается", "Хммм.... кто понимает хорошо в opencv! Нужна\nПомощь (", "Кто с peewee orm работал?", "Господа, кто сможет помочь с ботом, просто советом.\nЧтобы не засирать чат спамом.", "Привет всем", "есть кто живой?", "Всем привет...", "Гайз, есть кто из Новосиба? Есть идея открыть там офис разработки, хочу посоветоваться с местными экспертами", "Добрый вечер , кто может помочь разобраться с задачами pathon очень нужно)", "А кто-то делал телеграмм клиента своего?", "Добрый день есть кто пишет программы на заказ?", "Привет)\nЗдесь есть дата саентисты? Можно поспрашивать кого-нибудь про pandas & numpy?", "Кто разбирается в криптографии, сертификатах и ключах, а также в Trusted TLS", "Привет ребят\nКто нибудь обучал нейросеть (не важно на каком ЯП)?", "Привет", "Парни, понемаю что для болшенства этот вопрос кажется детским, и очень хочется поглумиться, но может у ког оесть возможность помочь?", "Добрый вечер, тут помогут новичку в 5 строчках кода?\n🌲🌲🌲", "Привет, ребята, кто-нибудь пользуется библиотекой miniupnpc", "Народ, кто-нибудь имел дело с разработкой GTK GUI приложений? (на питоне)", "Всем привет . Кто знает как создать бота ? Долго рылся в интернете но не чего не подходит", "есть кто-нибудь кто в c++ шарит и не против немного помочь? много времени не отниму, буквально пару минут", "Убунтоводы имеются?", "Ну ладно не буду", "Ну что, питонисты, как поживаете?", "всем привет, кто может проконсультировать по requests ?", "Привет всем народ ✌️", "на нубский вопрос тут смогут ответить?", "Добрый день, помогите пожалуйста, кто работал   с Flask + leaflet ?", "всем привет)", "Ребят, а есть кто из Таганрога?", "Не знаешь, есть ли тут кто-то, кто силен в openCV?", "Всем привет! Ну что, питонисты, как поживаете?", "ребзя помогите", "Всем хай можете помоч"], "ru_python_beginners": ["А кто в Django шарит ?", "Ребята, хелп", "Нейросетевики есть?", "Как решить проблему?", "Можно спросить?", "Привет", "привет товарищи", "привет", "напишите в лс кто шарит", "Emacs ктонить пользуется?", "Ребят, кто с InlineKeyboard дружит? \nОчень нужна ваша помощь. Никогда не работал с ней... Сейчас все через Ж идет...", "Есть люди, разбирающиеся в Джанге? :)", "есть тут кт нибудь?", "Тут помогают с питоном?", "Есть спецы по TensorFlow ?", "Привет! Тут кто нибудь работал с tesseract?", "Привет! Тут кто нибудь работал с tesseract?", "никто не использовал либу pyAudioAnalysis для анализа аудио файлов?", "кто-нибудь работал с sharepoint?", "вопрос такой", "Поможете?)", "Кто может подсказать по pyTelegramBotAPI?", "Кто может помоч с проблемкой", "Не нашел ничего не в шапке, не на гитхабе.", "Есть кто разбирается в python + excel ?", "Народ, а есть те кто с QML работал, вопрос с WebEnigne?", "Кто нибудь шарит в PyQT ?", "привет всем, может кто с задачей на курсера помочь? встал в ступор ппц", "Привет, здесь же можно спросить о питоне/как на нем кодить?", "Здарова всем", "Правило киргхофа кто помнит?", "Всем привет!", "Добрый день, подскажите как лучше начать изучать питон? Курсы или самостоятельно? Если курсы то какие? Если самостоятельно то какие книги?", "ребят, кто шарит хорошо в питоне и сможет помочь сейчас решить задание для собеседования, напишите в личку", "Чуваки всем привет. Кто-нибудь selenium ипользовал?", "Всем привет", "Здравствуйте", "Эксперты по докеру есть?)", "Доброе утро всем. Кто-нибудь писал ботов для дискорда?", "Привет, можете кинуть ссылку на гиихаб файлик с чатами по проге? Раньше висел то-ли в шапке то-ли в пине", "Добрый день, есть кто шарящий в prometheus_client ?", "Гайсы", "Всем привет есть кто в сети? Нужна помощь по боту телеграм api http запрос", "Привет", "Никто случайно pyOpenSSL не юзал?", "Здравствуйте, извините но у меня сразу два вопроса возникло.", "Привет! Кто тут прям полный ноль?", "Скинь ссылку", "Привет , может кто-то помочь с оптимизацией кода ?", "Ребят", "Для начала начать писать весь вопрос в одном предложении.", "Добрый ночи или доброго времени суток у кого как!", "Здравствуйте мне нужна помощь.", "кто шарит в парсинге?", "Ребят, такой вопрос, кто то делал латежку для телеграм бота?", "Есть ботоводы?", "Кто то работала с WinRM либой?", "Ребят тут есть кто нибудь из дата сайнс?", "кто работает джуном?", "привет, есть кто нибудь кто шарит про пузырьковую сортировку?", "", "Добрый вечер, можно обратиться за советом?", "Потому что даже его \"просто поздоровался\" попадает под это", "доброй ночи неспящим", "товарищи,  скажите,  вы в курсе курсов по питону со Stepik'а", "Люди есть вопрос?", "Так лучше?", "Кто-то работал с WeeChat когда-то? Мне нужно от туда инфу вытягивать, как это сделать?", "Как запустить сервак  через андроид если есть исходный код бота написанного на Питоне", "С чего начать чтоб понять программу?", "Кто тут разбирается в вебсокетах?)", "Привет всем. Народ у меня к вам ахренено тупой вопрос))))", "всем привет кто нить пользуется ОС АРЧ линукс?", "Здравствуйте,есть люди,которые что-то смыслит Pyqt?", "привет всем)", "Народ, кто-нибудь юзал vkscript?", "Кто-то тут разбирается в координатах на питоне?", "Тут есть люди, шарящие в html5?", "У менч вопрос", "Привет всем", "Vitalii Savchuk:\nкто нибудь имеет опыт работаы с системой Odoo ?", "Доброго времени суток народ. Можно вопрос?", "Кто использовал билблятику folium", "nepython.ru", "Привет!\nЯ сегодня начал новый проект по программированию на python.", "Помогите с ботом", "Всем привет, как дела?", "Есть тут люди с маком готовые помочь?", "Ребята, скажите, я могу тут задать вопрос про пайтон3 касаемо работы с xml?", "Одна задачка есть занимательная, поможешь  с алгоритмом решения ?", "Можно поинтересоваться, кто-то настравил тут виртуалки?)\nНадо помочь с настройкой, под винду.", "Пацаны а кто-то читал SICP?", "Не по питону конечно\nНо мейби кто работал с sqlite?", "кто за монго шарит в питоне?", "Ты чо доебался?", "можно вопрос задать?", "Всем привет", "Кто по вебу?", "Есть кто с Узбекистана? Кто учится в ТУИТ?", "всем дня", "Кто-то работал с 1с через com?", "Всем доброго времени суток. \nКто-то работает/работал с Selenium?\nНужна помощь", "есть кто с Украины?", "nometa.xyz, neprivet.ru", "всем привет. кто нибудь юзает библиотеку instagram для парсинга?\n\nкак парсить пост, если в нем несколько фото? у меня получается выдернуть только первую фотку и все\n\nсоррян, исправил", "Я просто поздоровался , только хочу начать внедрение в мир программирования и пайтона", "Всем привет !", "Ребят кто нибудь работал с api graph для Инстаграм?", "Чет твой прицел сбился", "Всегда рады :>\nЕсли есть вопросы по содержанию текста по ссылке высказывайте администрации чата их.", "Всем привет", "Всем привет, кто ни будь писал на Rexx? В связке с Zoc-ком.", "кто имел дело с TensorFlow?", "проще сказать, кто не имел. Вопрос есть конкретный, или тебе просто интересно?", "Есть кто нибудь кто ботов делал для Whatsapp? Хотел проконсультроваться", "Всем привет!", "кто в линуксе разбирается?", "Кто шарит в фотошопе?", "А, кстати, хотите орнуть", "ребят можете кто помочь?", "есть кто в https://nats.io шарющий?", "Привет. Кто нибудь учил по sololearn?", "Смотрю тут и про ос срачи☺️", "привет, помогите плис, в коде работаю с файлами, но у меня кое что не получается, так как раньше писала только в с", "привяо всем", "Всем привет, есть те, кто пользовался bitaps api?", "Привет, ребят. Можете помочь по дуалбуту?", "Всем привет !!!\nКак ваши дела ???\n.", "здравствуйте, кто-нибудь имел опыт написания бэкэнд вэб сервиса на питоне?", "Привет", "Кто шарит в Telegram-ботах?", "У кого был опыт реверс инжинирингом?", "тут есть люди шарящие в kivy?", "Всем привет", "ТОВАРИЩИ!", "Кто-нибудь писал проги на питоне для гугл доков?", "кто-то знает GPSS( моделирования)", "Всем доброго времени суток.\n\nЕсть тут люди, которые пишут ботов для Телеграма?", "кто-то парсил инстаграм питоном?", "Ребята, привет", "Интересно кто нибудь занимается машинным обучением?", "Кто здесь в ПТУ учился?", "Парни, всем привет. Есть среди вас, кто нормально Flask знает. Небольшой вопрос есть по FlaskForm и Ajax.", "Здравствуйте, а тут есть питонисты?", "Привет всем! Есть тут спецы по Flask?", "Кто читал эту книгу", "Привет всем я начинающий говнокодер и копипастер", "Веберы есть?", "привет! Кто поможет с областями видимости переменных?", "Кто работал с библиотекой GitPython?", "Ребятки, делаю задание вузовское, связанное с LRU, кто может помочь?", "Кто нибудь работал с robotframework? Есть парочка вопросов, которые хотел бы уточнить.", "ребята", "Привет, можете помочь?", "привет", "Всем привет!", "Всем Приветь", "Привет! Есть тут люди, которые делали  Oauth авторизацию VK?", "ребзя", "доброго времени суток, подскажите чат для поиска вакансий на Марсе", "Здравствуйте, кто-то работает на Анаконде, в частности на юпитере?", "На beeware кто нибудь работал?"], "grouplinux": ["С zabbix работает кто-нибудь?", "здесь все линукоиды?)", "всем дарова", "народ есть вопрос по shellу", "Сама сиди", "Кто-нибудь рпзворачивал nextcloud", "Народ привет", "Есть кто шарит в fail2ban?", "Кто-то пользовался ZRAM?", "Есть суровые линуксоиды на связи?", "почему в iptables может prerouting не работать?", "Как дела?", "кто ставил Torch?", "кто пользуется текстовым редактором Atom ?", "Кто в VS Code работает?", "Всем привет! У меня вопрос", "Кто знает теорию вероятности,  есть такие?)", "микротоводы здесь водятся?", "всем привет, кто может помочь с баш скриптом?", "Есть сишники ?", "кто WireGuard настраивал?", "Может кто помочь с освоением всего этого?", "Всем привет", "ребзя, кто знает", "Привет", "Здравия всем. Есть вопрос по dd, желающие могут подсказать", "nometa.xz", "кто в iptables шарит ?", "всем привет", "О чем разговаривать с девушкой на первом свидании?", "Хотел с вами посоветоваться", "Дратути", "Привет всем", "Привет Месным Обитателям....\nНайдется тут не охеревшый линуксойд без короны и сможет мне по полочкам подсказать,\n а не отталкивать", "кто настраивал постфикс на убунте ?", "есть рубисты?", "ребята, есть кто кодит на Spring?", "Есть тут кто на яве кодит ?", "anyoe can help in english ?😅", "есть кодеры на си ?", "Юристы есть?", "Привет неспящим", "Всем, Здравствуйте!", "Можно задать тупой вопрос", "аа", "Всем привет", "всем привет )", "ктото пользовалься cBackup-ом ?", "Народ здарова, впопрос есть кто работает с докер апач и всякая такая фигня, надо помощь если кому-то не сложно, а то я что-то не выходит", "Привет всем!", "Народ здарова, впопрос есть кто работает с докер апач и всякая такая фигня, надо помощь если кому-то не сложно, а то я что-то не выходит", "Хаюшки. Кто в  Linux Kodachi  шарит?", "народ, вопрос срочный", "есть кто,  кто готовиться  сдаче RHCE, или уже сдал можно было бы пообсуждать лабы или какие то подводные камни.", "Можно ли задать нубский вопрос по Линуксу и не быть битым матерыми линуксоидами? :) Всем привет.", "Все тут?", "Кто-нибудь сталкивался с траблом совмeстомости с Geforce ?", "Я хотел спросить насчет format", "Привет, ребят, нужна помощь", "Может не в тему)\nНо, можете помочь?", "Может кто-то помочь с ssh авторизацией по ключу? Все сделала верно, а оно не работает, может в конфиге что-то...", "ребзя привет, вы тут только сретесь ил помочь тоже можете?", "Почему у вас столько злости к человеку, который всего лишь печатает что-то непонятное в чат?", "Привет,решил перейти на Linux", "есть пользователи ryzen 2200g?", "кто может помочь ?", "У меня беда, кто поможет?", "Всем привет.\nКто накатывал Debian Sparc на t5120?", "Ребята кто имел дело с touchpad  synaptics", "сроочна", "Сразу вопрос, кто нибудь пользуется snapcraft-ом?", "Господа Добрый вечер. На манджару кто нибудь sac-core ставил из аур ?", "по настройке exim может кто подсказать?", "Кто может помочь", "У меня вопрос по отвалу сети, могу сюда задать вопрос?(win+fedora)", "Кто тут может по Foreman подсказать?", "всем привет, кому удавалось мигрировать атачи между инстансами джиры?", "Здесь никто с User Long Poll API VK не работал?", "Хай пепл 😂", "Всем привет.\n\nЕсть владельцы Lenovo G50-45?\n\nВопрос установки AMD Catalyst + Debian 4.18.10", "Есть ли тут те кто в вмварях волокет?", "Парни есть кто шарит в Kerio?", "Кто-нибудь в iptables рабирается?", "памагите", "Кто умеет с ++?", "Есть тут кто из Польши кто админом/pydev работает?", "Понял. Привет, есть тут интересующиеся работой в IT в USA?", "Где все", "Привет всем!", "стоит у кого-нибудь linux рядом с виндой?", "Прочитай", "Кто с kvm qemu работал?", "шарит кто в бд ?", "кто-нибудь шарит в питоне?", "Приве́т", "Может кто поможет с vpn", "вопрос в компиляции скрипта в .exe", "Дароу. Кто то ставил Винду и убунту на один комп ?", "??", "Кто тут с пк и желает выручить?(10-12 сек займет)?", "Добрый день, есть вопрос. В иксах хорошо кто-нибудь разбирается?", "Привет всем!", "тут в хакинтоше шарющие есть?", "Добрый день. Запускаю Kali в лайв режиме с флешки. Требует пароль. Что это значит?", "Кто-то работал с astra linux?", "Ребят совет по nginx конфигу нужен, может кто помочь? Эт не оффтоп ваще тема?)", "Есть знатоки freebsd?", "помогите с прошивкой роутера", "Господа, может кто ответить на пару вопросов по поводу коллизий хеш-функций?", "Зачем", "Можете меня обоссать и помочь с регуляркой? я в них ваще не шарю, туториал прошел но все равно не получается", "кто  на stepik питон изучал?", ""], "botoid": ["Есть кто из москвы?", "Здраствуйте..Хотела кое что спросить", "В принципе, под эту ситуацию это не подходит. Скорее всего он просто вступил в чат и поздоровался со всеми(не имея намерения задавать вопросы).", "Я хочу задать один вопрос", "neprivet.ru", "Ребят, кто ставил MTProto ?", "Привет, кто может помочь с содзанием бота?", "Кто сможет помочь", "всем привет, извиняюсь за оффтоп, просто не знаю, где ещё спросить, с Facebook API кому-нибудь доводилось работать?", "Telegram-Site-Helper-2.0 \n\nОтправленные сообщения не отображаются в виджете. \n\nКто - нибудь сталкивался ?", "Всем привет есть кто кодит в c++ или c#", "Ребят, кому блокировали кошелек киви? Я имею ввиду ставили ограничения на исходящие платежи?", "Салют, есть люди делающие сайты на джумле или вордпрессе", "оно в ответ только работает вроде", "Привет всем. Делал кто онлайн-оплату через яндекс?", "Ребят, нужна помощь с aruba, кто может помочь?", "народ а тут ботоводы есть?", "Привет, ребята\nКто-нибудь когда-нибудь делал бот анонимного обмена сообщениями", "Есть кто в инстант виев шарит?\nкак к body приконкатинатить кусок текста из другого блока?", "Есть кто работал с tdlib на винде?", "Кто-то ставил вебхуки на джанге?", "Привет", "Возможно я не понимаю структуру или принцип как тут все организовано, может есть какая-то карта? Я вижу отдельные файлы кода, как мне понять что к чему?", "кто работал с телеграф апи?", "Кто работал в API amocrm", "есть у кого опыт работы с clickhouse? а то есть пара тупых вопросов", "вот уже накидал немного", "!nometa", "проблема только в нехватке строк в бд", "Кто узбек язык знает", "Кто-то работал с апи amocrm?", "Тут есть умные которые знают node js?", "кто-то работал", "народ всем привет, кто по  SQL помочь может?", "норот, а подскажите момент", "возник теоретический вопрос", "доброе утро", "Есть кто работал с Гугл картами из бота?", "Привет всем, народ", "Всем привет)", "Ребят, кто на Python и пытался написать бота в телеграмме, в ЛС отпишитесь.", "Народ, привет!\nКто-нибудь делал тг бота с админкой?", "rnj evttn настройка api qiwi в telegram", "Всем привет", "Гошники тут есть?", "хеллоу всем! Ребят, занимается тут кто извращенством вроде ботов на Джаве?", "есть тут кто пользовался БД редиса?", "есть тут кто пользовался БД редиса?", "Здравствуйте.\nПишу бота на языке Java. Кто нибудь сможет мне помочь?)", "Парни а можно еще задать один вопрос возможно из области фантастики но все же просто интерестно реально ли такое сделать7", "React native guru тут есть?", "Помогите мне пожалуйста", "Ребят, привет , кто хорошо знает С++ , есть пару вопросов , буду благодарен если ответьте на них)", "кто на digitaloceam сидит?", "Сколько будет 1+2+3+4+5+6+7+8+9", "Сколько будет 1+2+3+4+5+6+7+8+9", "И есть ли тут люди, которые писали ботов на элексире?", "БД не обрабатывает запросы по каким-то не виданным причинам."], "android_ru": ["никто с дип линками facebook не работал вообще ?", "", "помогите пожалуйста зделать такое меню", "Всем привет, есть тут люди которые работали с facebook sdk и их аналитикой?", "Порекоммендуйте либу для работы с нетворком через тор", "Есть ли кто, ставивший twrp на xiaomi?", "Кто Exoplayer пользуется?", "Всем привет, есть тут люди с опытом использования mobile mongoDB?", "Всем привет. Кто то разрабатывал приложение для smart tv?", "", "Как что не спрошу в ответ тишина", "Кто нибудь юзал эту либу?", "Всем привет! Кто-нибудь использовал input-mask-android от RedMadRobot?", "Что с вами, люди)", "Помогите люди, может кто с libgdx знаком", "Друзья кто работал с сткетами, клиент андроид и сервер, кто может мне помочь. Я не могу разобраться как файлы отправлять, очень прощу =)", "кто-нибудь юзал class Messenger c MVP?", "Привет, кто работал с PdfDocument ?", "Кто использует CI?", "Привет, кто-нибудь сталкивался с падениями на Meizu с Android 6 при получении фокуса у TextInputEditText?", "@Harmonizr работал с авторизацией через социальные сети?", "Плз, мне кажется у кого-то точно должно быть)", "Уже мигрировали на androidx?", "Кто нибудь работал с canvasom v Androide", "Здравствуйте всем. \n\nНарод у кого под рукой прям сейчас открытая студия есть?", "кто-нибудь реализовывал in-app billing в приложении?", "всем привет\n\nmust be signed with the platform certificate.\n\nкак это можно понять?", "Товарищи, и есть кто не спит?", "кто юзает rxJava в котлине?", "Кто может помочь с Admob?", "Понял. Есть кто шарит в android studio и java. Создаю приложение для колледжа с расписанием, т.к. я ещё дурачек и только начинаю хотел бы узнать может имеются какие-то исходники чтоб разобрать и посмотреть? В Гугле искал и на гитхабе тоже, в итоге ничего похожего и близко не нашел.  Хотелось бы увидеть что-то подобное. Может даже более функциональное.", "Ребят, тут есть, кто юзал Room DB?", "в мира андройда да", "Всем привет. кто-то работал с cardova ?", "Кто нибудь пользовался Firebase ?", "Всех приветствую, очень нужна помщь. С библиотекой SImple xml. Не получается парсить массивы", "кто умеет писать тесты, тестировать android приложения?", "У кого установлен Андроид студио?"], "DotNetRuChat": ["Ребят, кто шарит в ентити фреймворке"], "css_ru": ["Всем привет", "Нужна помощь, поддерка и любовь)", "ребят кто работал с lottie-web?", "Здарова)", "Привет"], "JSlang": ["Тут есть опытные фронтенд разработчики?", "юзал кто яндекс контест ?", "подскажите мне канал ксс стилей", "Hi mans", "Привет, программисты", "кто нить знаком с keystonejs?", "Всем привет! кто-нибудь разбирается в jest и enzyme?", "Ребята нужна помощь", "кто тут разбирается в api yandex map?"], "javascript_ru": ["Что творится", "Ребят, всем привет) Кто нибудь пользовался библиотекой fullpage.js?"], "javastart": ["Привет всем, есть кто-то кто использует sysdev kalipso?", "Всем привет, может ли кто дать краткую консультацию по sonarqube?", "это тот самый чат где можно задать нубский вопрос по яве ?", "есть кто нибуд исползувал firebase в Javafx проекте?", "Ребята, привет, кто нибудь выкладывал проекты на heroku??", "Всем привет.\n\nКто-нибудь работал с Google Cloud Platform ?\nВ частности Cloud Storage Client Libraries"], "jvmchat": ["Работал ли кто с новым google map API в андроид", "всем привет кто нить работал с самба сервером?", "есть эксперты по spring aop ?", "парни, есть кто не плохо в html шарит?", "Здарова, молодежь.", "Привет. Кто-нибудь в проектах использует 10 джаву?", "Привет, кто-нибудь работал с InfluxDB ?"], "kotlin_lang": ["народ, кто под андроид Koin юзал?", "Добрый день. Ребят кто пробовал котлин для бэка? есть пара вопросиков на счёт пути обучения)"], "propython": ["товарищи, кто упарывался с пакетом vk_api?", "Всем привет! Есть здесь кто-нибудь разбирающийся в распознавании лиц (OpenCV, Dlib, face_recognition)? Мне буквально пару вопросов задать)", "А кто нибудь занимался анализом изображений? - есть вопрос"], "rudepython": ["Привет, кто может мне помочь по питону?"], "phpGeeks": ["кто в битриксе разбирается", "Может кто-то новичок в MVC?", "вопрос не по теме: кто-нибудь подключался к ГИС ГМП для получения шрафов гибдд?", "Ребят, а шарит кто в вордпрессе ?", "Всем привет. Кто может проконсультировать по Opencart 2.3 по статусам заказов?", "Добрый день товарищи! кто нибудь из вас делал модули на битриксе?", "Парни кто знаком с redbeanPHP?", "на несколько вопросов ответить если время есть)", "Кто пользовался bson?"], "rustlang_ru": ["Ребят, я чутка запутался в генериках, поможете?"], "scala_ru": ["кто-нибудь сидит на scalatags?"], "ru_1c": ["есть кто работал с конфой Администрирование информационных баз?"], "angular_ru": ["Кто то подключал npm rangy в проект ?"], "ru_flask": ["Ты же не думал, что я вопрос хотел задать?", "кто-то использовал Nameko?"], "pydjango": ["Кто-нибудь использовал OAuth 2.0?", "привет я делаю сайт для пицерии. Объясните мне как происходит заказ товара или скиньте ссылки", "Кто нибудь размещал джанго приложение на heroku через gitlab? Почему может не подцепляться bootstrap? И нужно ли при деплое делать миграции?", "Всем привет.", "Привет всем", "Всем привет! Ребят, а может кто-нибудь разъяснить несколько вопросов касательно форм в джанге?"], "laravel_pro": ["Всем привет.", "Можно вопрос", "Привет всем", "Всем привет! Кто-нибудь работал с плагином FilePond на laravel? https://github.com/pqina/filepond"], "laravelrus": ["\"пиши\" пишется с буквой \"и Э"], "reactnative_ru": ["привет, есть кто, кто пользуется mobx-state-tree?", "Всемь привет! Имеет ли кто-либо опыт работы  с подписками iap purchase на IOS / Android?"], "pro_net": ["а можно вопросец по дотнетикам?"], "react_ru": ["Как без вопроса?"], "springframeworkio": ["народ, сори, но знаете где можно подучить(желательно на русском, можно и на англ)", "Есть кто-то кто разрабатывал что-то на платформе Ethereum?"], "webpack_ru": ["Привет, ребят\nЕсть вопрос по post-css loader для  *.scss файлов\nЕсть кто, кто работал с таким?", "Кто-нибудь использует group-css-media-queries-loader?"], "SublimeText_RU": ["Есть ли учебники по саблайму?"], "proalgorithms": ["Может кто-нибудь тут подсказать, возникла пара вопросов по поводу конечных автоматов для разборов строчек?", "10 строчек буквально", "кто может помочь объяснить работу очень небольшого алгоритма?", "добрый вечер", "Ребят, привет.\nМожно вопрос по округлению?\nСпросил бы в чатике с простыми вопросами, но там только боты сидят("], "eth_ru": ["Ребята, кто-то слышал о evenfound?"], "annode": ["кто-то магаз делал на ларке ?"], "tpverstakchat": ["снова промазал", "тут с модулями могут помочь?)", "здравствуйте есть кто хорошо Понимает и знает javascript?", "Кто-нибудь разбирается в Cache API?"], "letsCodeChat": ["Всем привет.\n\nВажный опрос. Тут много тех, кто проходил OCA?\n\nКак именно вы планировали свою подготовку?"], "probuildsystems": ["Привет всем, кто нибудь работал с bamboo?", "Привет всем. Кто нибудь настраивал сборку и развертку сервака Bamboo?"], "unixtalks": ["кто шарит за хтацесс?"], "prographon": ["Всем привет! Есть специалисты по Visual Effect Graph в Unity3D или по UI/UX в Unity3D? Нужна консультация или если интересно будет участие)", "Можно задать вопрос по ОпенГЛ?"], "unity3d_ru": ["Есть несколько вопросов по данному плагину. Кто может проконсультировать?"], "ru_sysadmin": ["привет! \nтут кто-то может помочь с ssh тунелями?)"], "asterisk_ru": ["привет всем, есть кто тут знаток"], "mysql_db": ["Please do not ask meta questions in the chat!\nA meta question is a question that implies other questions, for example:\n\nCan I ask a question?\nIs there anyone who understands N?\nAnd did anyone here take a course from Yandex on the cursor? There is a text analysis question ...\nGuys, there is a question for% framework_name%\n“It’s clear, but what’s wrong with these questions and why shouldn’t I ask them?”\n\n- They are wasting time! And yours, and other people who are trying to help you! You try to be polite, without going straight to your problem, as people do in person. But chat is completely different. People type much slower than they say. Instead of being polite, you force the other person to wait while you formulate the question, which leads to a loss of performance.\n\nThe same applies to such messages: “Hello”, “Hello. Are you here? ”,“ Have a minute? ”,“ Ping. ” Just ask a question!\n\nIn addition, when you ask a question immediately, the possibility of asynchronous interaction opens up. If the other person is unavailable, and you leave before he returns, he can still answer the question, instead of looking at your “Hello” and thinking about what happened.", "добрый вечер", "Доброе утро всем) парни, а кто может глянуть php запрос по выводу значений из БД, мне кажется, я там что-то накосячил)) и значения запрашиваются из БД почему-то по 2-3 раза из-за этого ответ долгий"], "datasciencechat": ["Кто разбирается в анализе изображений?"], "hadoopusers": ["ну просто мне скоро предстоит с ней работа"], "ai_life": ["Привет. У меня есть срочный еб*231тый вопрос на тему дифференциальных уравнений в прогнозировании результатов на основании существующих данных за 3 года. Есть желающие поломать голову?", "Привет всем, есть кто сверточными сетями занимается?", "так вы занимаетесь?"], "DC7499": ["Всем привет, в этом Чате есть Java разработчики?"], "ctfchat": ["Есть спецы", "Тут не банят за тупые вопросы?"], "mrl_hack": ["был оффтоп", "есть кто ?", "ребят, посоветуйте пожалуйста конфы (можно и не в телеге) по спаму, шеллам и прочему трафикодобывательству"], "ArchLinuxChatRU": ["Есть пользователи pulseeffects ?", "Есть челы с опенвпн сервером?"], "russian_gentoo": ["Кто з питера", "Всем привет. Есть тут обладатели ноутбуков msi с видяхой, которая работает по технологии optimus?", "Может кто с ядром помочь?"], "macos_ru": ["Добрый вечер \nУ меня вопрос"], "manjarolinux": ["это я так приветсвтуюсь"], "ru_openSUSE": ["Мужики может кто нибудь помочь с проблемой в leap 42.3 ?"], "ru_ubuntu": ["почему  ubuntu такая нестабильная по сравнению с windows?", "халлоу", "Кто шарит в Эссембли?", "Привет всем! Есть кто нибудь кто работал с MySQL на убунту/линуксе?", "есть кто в мафию играет?"], "pro_windows": ["Я сейчас посплю, но пока первый абзац без потери смысла можно выпилить", "здраствуйте поможете?", "как дела чем здесь занимайтесь"], "higher_math": ["Можно ещё один вопрос?", "Господа, недавно начал изучать алгебру Буля,  не могли помочь с одним лёгким примером?"], "ios_ru": ["Парни, привет! Делаем проект, юзаем ARKit. Встряли, не можем решить задачу. Кто работал ARKit фреймворком, дайте знать, пожалуйста"], "ru_raspberry": ["Кто то оожет проконсультировать?"], "vscode_ru": ["Привет ребят есть тут кто"], "distributed": ["Подскажите сайт куда посылают людей, которые задают вопрос в чате типа \"а можно задать вопрос\""], "ru_traders": ["Ребята кто то работает на Crypto?"], "pro_esp8266": ["Ребят есть кто умеет печатные платы разводить? Напишите в личку", "Добрый вечер народ. Кто нибудь мучал датчики me2-o2?"], "ru_arduino": ["Иншалла 👆питонисты присутствуют?", "Добрый вечер!Есть ли здесь кто-то из програмистов ардуино из  г Днепр?", "может есть у кого опыт реализации подобной задумки? Чтобы указали конкретные комплектующие и проконсультировали как собрать. Чтобы заранее уже понимать, что этот набор заведомо работает как задумано", "А тут можно спрашивать про детали про которые я не знаю что это?) есть деталь, а я не знаю что это. Мне надо узнать название и как проверить работает ли она", "кто в modbus и opc server шарит?", "Есть тут владельцы?", "Ребята, кто P-CAD  использует?", "Добрый день, есть тут знающие Ардуино?", "@Th0rN13 hi! не сталкивался с ремонтом подсветки в телеке Sony KDL-65W855C?", "Привет есть спецы по чистотным преобразователей"], "seochat": ["Здравствуйте. Подскажите, юридические услуги кто нибудь продвигал?"], "startupneversleeps": ["Был кто в грузии после легалайза?", "Кто-нибудь пользовался DeepPavlov?", "В общем если такие люди тут есть, напишите в личку", "Всем привет! Нет ли тут людей, работающих в Испании в сфере AI/Computer vision?", "Кто-то когда-нибудь что-нибудь делал с финансовыми отчётами ?", "есть кто работал с Jasper-ом?", "Ребята! Выручайте - Есть среди Вас  1с- специалисты или возможно у Вас есть кто-то из адекватных?", "Кругом одна ирония, постоянно! Если человек хуево пошутил, нужно усомниться, подумать, что нам _показалось_, переспросить, наверное он не это имел в виду, нужно позаботиться о нем... в то время, как человек почему-то не позаботился о тех, кто это прочтет.", "А есть тут кто-нибудь, кто занимается или занимался сегментацией пользоватеей для рекламы? Когда нужно сегментировать пользователей на определенные классы.", "Ребят, а есть тут кто-нибудь с интернет магазином? Есть вопрос по онлайн кассам", "Перепись любителей тратить чужое время зря?"], "linkmeup_chat": ["ребятки, кто-нибудь  каты 9200, 9300 юзает?"]}